---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle.BoltDiameterShorterFlange
source: html/8b983788-b3f2-7c45-a67f-32fc403ec4ec.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle.BoltDiameterShorterFlange Property

Maximum bolt hole diameter in the shorter flange, in. (mm)

## Syntax (C#)
```csharp
public double BoltDiameterShorterFlange { get; set; }
```